run/reactants_products_1D/0/reactants
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1.;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1.;
        lInf            1e3;

        // type            zeroGradient;
    }

    empty
    {
        type            empty;
    }

}


// ************************************************************************* //
